app/Controllers/AuthController.php

SELECT *
FROM `usuarios`
WHERE `email` = 'admin@mycar.com'
 LIMIT 1
---
    public function procesarLogin()
    {
        $usuarioModel = new UsuarioModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Buscamos al usuario en la BD
        $usuario = $usuarioModel->where('email', $email)->first();