app/Controllers/VehiculoController.php

SELECT *
FROM `vehiculos`
ORDER BY `id` DESC
---
    public function indexAdmin()
    {
        $vehiculoModel = new VehiculoModel();
        // Traemos todos los vehículos, activos e inactivos, ordenados por ID
        $datos['vehiculos'] = $vehiculoModel->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `vehiculos`
WHERE `vehiculos`.`id` = '2'
---
    public function editar($id)
    {
        $vehiculoModel = new VehiculoModel();
        $vehiculo = $vehiculoModel->find($id);