app/Models/ClienteModel.php

    public function getClientesActivos()
    {
        return $this->where('esActivo', 1)->findAll();
---
SELECT *
FROM `clientes`
WHERE `esActivo` = 1